---
layout: post
title: "think about.."
date: 2006-02-23 01:36:14 +0900
---

게임에 사용할 gui 작업을 하는데, 아직 이쪽에 경험이 별로 없어서 인지, 매번 노가다로 테스트를 하면서 하나 하나 수정해 나가는 방식이 너무 힘들다..<br/><br/>이럴 때에는 경험자가 있으면 좀 좋을텐데..<br/><br/>경력을 따지면 벌써 4년이 되어가는데, 아직 타이틀을 가지지 못해서 인지, 실제 게임에 사용할 때에 대한 것들에 대한 꽤 여러가지 변수를 고려하지 못하는 경우가 많다..<br/>엔진을 작업할 때에도, 짜임새는 좋다고 생각을 하는데, 아직 어떤 식으로 사용이 될지에 대한 경험이 부족한 것이 좀 많아서 인지 확장성이 약간 떨어지는 듯한 느낌도 나기도 하고,<br/><br/>현재 생각하고 있는 것은 controller(애니메니션, 이펙트, 알파값 조절 하는 등)의 역할을 하는 녀석을 조금 더 확장성 있게 사용할 수 있도록 만들었다면, 더 많은 작업을 쉽게 했을텐데 하는 것이다..<br/><br/>또, 느끼는 것 중하나가, 다음에는 stl 보다 컨테이너를 직접 만들어서 사용하는 것도 좋을 것 같다는 것이다.<br/>Array, list, map, queue, stack 이 정도만 있어도 게임에서 사용하는 녀석을 거의 다 수용할 수 있을 듯 한데, stl을 사용했더니 메모리도 문제가 되는 것 같고, 하나 하나 만들어 보면서 속도도 테스트 해보고.. 준비를 좀 해야 될 듯 하다..<br/><br/>내가 만드는 것이 다른 것과 견주어 볼 때, 훌륭하지는 않는다. 하지만, 여기서 느낀 것을 철저히 준비해야 한다...<br/><br/>공부 목록<br/>-Container 들을 한번 만들어 보자...<br/>-Engine 아키텍쳐에 대해서 연구해보고, 내가 만든것과 비교해보자..