---
layout: post
title: "Resignation"
date: 2010-04-19 23:11:14 +0900
---

<a href="http://cagetu.egloos.com/4276268" title="">CCR로 이적합니다..</a>라는 포스팅을 한지가 벌써 2년이 흘렀군요.<div>"기대해 주세요..."라고 했던 글이 무척 민망합니다. 제가 한 것이 별로 없어요.. ㅜㅜ.</div><div><br/></div><div>먼저 학교를 마치게 해주어서 너무 고맙습니다. 제 능력에 비해 과분한 대우를 받은 것 같아 항상 고맙습니다.</div><div><br/></div><div>"개발"이라는 것 자체에 대해서, 정말 많은 생각을 하게 해준 시간이었습니다.</div><div>또한, 저 스스로를 많이 돌아 볼 수 있었던 시간이기도 합니다.</div><div><br/></div><div>결론적으로 반성하고, 공부할 것이 너무 많다라는 것을 깨닭았습니다.</div><div><br/></div><div>회사에서는 분에 넘치게 좋은 제안을 해주었지만, 결국 제 마음이 가는 쪽으로 선택을 했습니다.</div><div>그 선택을 존중해준 사장님에게 감사의 말씀을 전합니다.</div><div><br/></div><div>팀원들에게 프로젝트 성공을 진심으로 기원합니다. 꼭, 나오는 것을 보고 싶거든요.. ㅎㅎ</div><div><br/></div><div>한 동안 자신감도 많이 떨어지고, 의기소침해져 있었는데, 언제나 그랬든, 많은 연습과 학습으로 회복해보겠습니다. ^^</div>