---
layout: post
title: "[To ME] Wind Of Change"
date: 2011-02-19 01:53:41 +0900
---

<div>스트레스와 남의 탓, 불평과 불만이 많아졌고, 별 것도 아닌 일에 화도 잘 내게 되었다.</div><div>특별히 하고 싶은 것도 없고, 무엇을 해야하는지도 모르는 그런 상태....</div><div><br/></div><div>슬럼프... 어느 덧 알게 모르게 이런 녀석에게 발목을 잡히고 말았다고 느껴졌다.</div><div><br/></div><div>병특도 마치고, 회사를 옮겨야만 하고, 정들었던 팀원들과 흩어져야만 하고, 학교를 마치고, 가정이 생기고, 아이가 생겼다. 참 많은 변화들이 몇 년간 일어났다.</div><div><br/></div><div>하지만, 내 의식은 나도 모르게 이런 모든 변화들을 받아들이려고 하지 않았다. 너무나 익숙했던 어쩌면 편안하기까지 했던 시간들을 나 스스로 버리고 싶지가 않았던 모양이다. 이런 저항은 나도 모르게 꽤 오래 지속되었고, 불과 얼마전까지만 해도 나를 붙잡고 있었다. 나는 병들어만 갔다. 몸도 마음도....</div><div><span class="Apple-style-span" style="font-family: Verdana; "> </span></div><div>세상(+주변 환경)은 변한다. 나의 의지와 상관이 있든지 말든지.. 그게 좋은 것이든 나쁜 것이든....</div><div>그 변화가 나한테 고통을 주거나 줄거움을 줄 수 있다. </div><div><br/></div><div>나도 거기에 맞추어서 나를 변화 시켜야 한다는 단순한 사실!!! 이 사실을 깨닭는데, 나는 많은 시간을 괴로워했다, 진심으로... </div><div><br/></div><div>지금은?! 약간의 변화를 주었고, 오랜만에 즐겁게 일에 집중하는 기분이다.</div><div>왠지 더 많은 것들을 할 수 있을 것 같고, 오랜만에 활기와 삶에 대한 열정을 느낀다.</div><div><br/></div><div>나름 상쾌하다......</div><div><br/></div><div>미래의 나에게.... 말한다.... 환경에 맞춰서 진화하자고!!!!!</div><div><br/></div><div>이게 인생인가보다... 참 재밌다.</div>