---
layout: post
title: "about memory / c++"
date: 2019-11-25 00:58:08 +0900
---

혼자서 Array / Map 등을 간단하게 만들어서 써보고 있는데, 이거 하나 구현해서 안정적으로 하기가 생각보다 쉽지가 않다. 대략 몇 달은 혼자서 다른 것을 만들다가도 결국 이게 문제가 되어서 다시 수정하는 작업을 반복하게 된다. 사실 하고 싶은 것은 새로운 무엇을 만들어보자는 것이었는데, 이걸 하고 있으면 그냥 stl 같은 것을 써볼까? 라고 포기하고 싶음 마음이 들다가도 다 해결하고 나면 배우는 것이 참 많다.<div><br/></div><div>요즘에는 회사에서나 집에서나 결국 C++이라는 녀석에 대해서 최신 사용방식을 잘 몰라서 놓치고 있는 것이 많다는 것과 여전히 메모리에 대해서 쉽게 놓치는 것이 많다는 것이다. C++을 쓰면서는 여전히 포인터에 대해서 잘 못 사용해서 문제가 되는 경우를 종종 경험하기도 한다.</div><div><br/></div><div>이런 경험들을 해보면서 Rust라는 언어에 관심이 조금 생겼다. Embark Studio에서는 Rust로 게임엔진 개발 시도를 시작했다고 하니, 더욱 관심이 간다. 틈틈히, 문법 공부는 해보려고 한다. <a href="https://rust-kr.org/" style="font-size: 9pt;">https://rust-kr.org/</a> 를 참고하면 된다.</div><div><br/></div><div>내가 참 여기까지 어떻게 왔는지 모를 정도로 코딩 기초가 참 많이 부족함을 느낀다. 알고리즘도 많이 약하고, HashTable 하나 한번 제대로 만들어본 적이 없는 듯 하다. 이번 기회에 집에서 만들어보면서 이런 부족했던 공부를 채워가보기로 하는 것도 의미가 있을 것 같아서, 때로는 이걸 왜 하나 싶기도 할 때도 있고, 때로는 몰라서 포기하고 싶을 때도 있지만 꾸준히 해보려고 한다.</div><div><br/></div><div>그래도 역시 코딩을 많이 해보면 배우는게 참 많다는 것을 느낀다.</div><div><br/></div>